itptest_mb/redis_stream/redis+stream_8/redis_output/redis7778.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
[...]
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
connection dropped.
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
[...]
connection dropped.
connection dropped.
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
connection dropped.
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
[RUN #1 11%,  20 secs]  0 threads:    11715000 ops,  603298 (avg:  585697) ops/sec, 600.92MB/sec (avg: 582.96MB/sec),  4.96 (avg:  5.04) msec latency

10        Threads
10        Connections per thread
180       Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets           0.00          ---          ---      5.04300         0.00
Gets           0.00         0.00         0.00      5.04300         0.00
Waits          0.00          ---          ---      0.00000          ---
Totals         0.00         0.00         0.00      5.04300         0.00