itptest_mb/redis_stream/redis+stream_8/redis_output/redis7780.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
connect: connection failed: Connection refused
connect: connection failed: Connection refused
connect: connection failed: Connection refused
[...]
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
[...]
connection dropped.
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
read error: Connection reset by peer
connection dropped.
connection dropped.
read error: Connection reset by peer
read error: Connection reset by peer
connection dropped.
connection dropped.
connection dropped.
[...]
read error: Connection reset by peer
connection dropped.
[RUN #1 6%,  10 secs]  0 threads:    12111240 ops,       0 (avg: 1164446) ops/sec, 0.00KB/sec (avg: 1.13GB/sec),  0.00 (avg:  2.52) msec latency

10        Threads
10        Connections per thread
180       Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets           0.00          ---          ---      2.52000         0.00
Gets           0.00         0.00         0.00      2.52000         0.00
Waits          0.00          ---          ---      0.00000          ---
Totals         0.00         0.00         0.00      2.52000         0.00